/*
Напиши програма која ќе ја испечати сумата на броевите деливи со 3 во опсегот [A, B),
каде што A и B се броеви прочитани од стандарден влез.

Објаснување:
А = 10, B = 20. Броевите кои припаѓаат во интервалот се 10, 11, 12, 13, ..., 19.
Деливи со 3 се броевите 12, 15 и 18, а нивната сума е 45.

Input: 10 20
Result: 45
*/
#include <iostream>
using namespace std;

int main() {
    int A,B;
    cin>>A>>B;
    int suma=0;

    for (int i=A;i < B;i++)
        if (i % 3 == 0) {
            suma += i;
        }
    cout<<suma;
    return 0;

}
