/*
Од стандарден влез се вчитуват броевите a, d, N.
На eкран да се испечатат првите N членови на аритметичката прогресија со почетен член a и разлика d.
Аритметичка прогресија е низа од броеви во која секој член е поголем за d од претходниот член во низата.
Пример, доколку а=1, d=5, првите 5 членови во прогресијата се:
1
6 (1+5=6)
11 (6+5=11)
16 (11+5=16)
21 (16+5=21)

Input:  1 5 5
Result: 1, 6, 11, 16, 21

input: 2 -2 10
Result: 2, 0, -2, -4, -6, -8, -10, -12, -14, -16
*/
#include <iostream>
using namespace std;

int main() {
    int a,d,N;
    cin>>a>>d>>N;

    for (int i=0; i<N; i++) {
        int clen = a + i*d;
        cout<<clen;
        if (i<N-1)cout<<", ";

    }
}