/*
Задача: Од стандарден влез се внесува број n (димензии за квадратна матрица). Потоа се внесува матрицата.
Да се трансформира матрицата така што секој елемент кој се наоѓа во исто времe под главната и споредната дијагонала во обратен број.
Обратен број на некој број е ако тој е позитивен да се претвори во негативен број,
а ако бројот е негативен да се претвориво позитивен број.
Input:
5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5

*/
#include <iostream>
using namespace std;

int main() {
    int n;
    cin >> n;
    int matrica[n][n];

    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            cin >> matrica[i][j];
        }
    }
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            if (i > j && i + j > n - 1) {
                matrica[i][j] *= -1;
            }
        }
    }

    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            cout << matrica[i][j] << " ";
        }
        cout << endl;
    }

    return 0;
}
