/*
Од тастатура се внесува природен број N, а потоа N цели броеви. За секој број треба да се провери неговиот остаток при делење со 5 и според тоа да се изврши соодветната операција:

ако остатокот е 0, испечати: бројот поделен со 5;
ако остатокот е 1 или 2 испечати: бројот собран со претходно внесениот број (освен за првовнесениот - се печати самиот број);
ако остатокот е 3 или 4 испечати: бројот помножен со 2;
Форматот на излезот е: во посебен ред, за секој внесен број да се отпечати резултатот на соодветната операција, како во примерот.

Oбјаснување:
за 6, остатокот при делењето со 5 е 1, според тоа треба да се испечати самиот тој број (бидејќи е првовнесен број), 6
За 25, остатокот при делењето со 5 е 0, според тоа се печати 25 / 5 = 5
За 7, остатокот при делењето со 5 е 1, според тоа треба да се испечати бројот собран со претходно внесениот број , 7 + 25 = 32
За 4, остатокот при делењето со 5 е 4, според тоа треба да се испечати бројот помножен со 2, 4 * 2 = 8

Input: 4 6 25 7 4
Result: 6 5 32 8
 */
#include <iostream>
using namespace std;

int main() {
    int N,n,p = 0, brojalnik =0;
    cin>>N;
    for (int i=0; i<N; i++) {
        cin>>n;
        brojalnik++;
        int ostatok = n%5;
        if (ostatok == 0) {
            cout<<n/5<<endl;
        }else if ((ostatok == 1 || ostatok ==2) && brojalnik == 1) {
            cout<<n<<endl;
        }else if ((ostatok == 1 || ostatok ==2) && brojalnik > 1) {
            cout<<n+p<<endl;
        }else if (ostatok == 3 || ostatok == 4) {
            cout<<n*2<<endl;
        }
        p=n;
    }
}
