/*
Да се напише програма која од тастатура чита непознат број на тројки цели позитивни (int) броеви:
A, B и контролен број K (се читаат додека не се внесе нешто што не е број).
Доколку броевите имаат различен број на цифри, потребно е да се претпостави дека помалкуцифрените броеви имаат цифри 0 пред најзначајната цифра (најлево).

На основа на овие три броja треба да се формира ултракомбиниран број.
Бараниот број се конструира со помош на цифрите на A и B во однос на контролниот број К oдејќи оддесно - нaлево, според следните правила.

Ако вредноста на изразот за соодветните цифри на А и В

(Acifra + Bcifra) / 2
1) .. е поголема од соодветната цифра на контролниот број K, се внесува цифрата од A;
2) .. е помалa од соодветната цифра на контролниот број K, се внесува цифрата од B.
3) .. е еднаква на соодветната цифра на контролниот број K, тогаш не се внесува ништо (цифрата се прескокнува).

На крај, ултракомбинираниот број се печати за секоја внесена тројка (редоследот на цифрите е како во примерот).

Трансформирањето на броeвите да се реши со функција/функции за освојување максимален број поени.

Објаснување:

                    ←(оддесно нaлево)
А = 133        0 0 1 3 3
В = 5678       0 5 6 7 8
К = 66654      6 6 6 5 4
(3+8) / 2 = 11 / 2 = 5 (целиот дел), 5 > 4, во бараниот број се внесува цифрата од А: 3
(3+7) / 2 = 10 / 2 = 5, 5 = 5, не се внесува цифра во бараниот број
(1+6) / 2 = 7 / 2 = 3 (целиот дел), 3 < 6, во бараниот број се внесува цифрата од В: 6
(0+5) / 2 = 5 / 2 = 2 (целиот дел), 2<6, во бараниот број се внесува цифрата од В: 5
(0+0) / 2 = 0 / 2 = 0, 0 < 6, во бараниот број се внесува цифрата од В: 0
Ултракомбинираниот број е: 563

Input: 133 5678 66654 !
Result: 563
 */
#include <iostream>
using namespace std;

int main() {
    int a,b,k;

    while (cin>>a>>b>>k) {
        int multi=0;
        int mnozitel=1;
        while (a > 0 || b > 0 || k > 0) {
            int da = a % 10;
            int db = b % 10;
            int dk = k % 10;

            if (((da+db)/2)>dk) {
                multi +=da*mnozitel;
                mnozitel*=10;

            }else if (((da+db)/2)<dk) {
                multi +=db*mnozitel;
                mnozitel*=10;
            }


            a /= 10;
            b /= 10;
            k /= 10;
        }
        cout<<multi<<endl;
    }
}

