/*
2. Од стандарден влез се внесува бројот на елементи во низа, а потоа и самата низа.

Да се напише една функција која ќе ги пронајде најголемиот и најмалиот елемент во низата,
ќе ја пресмета сумата на елементите на низата и ќе ја трансформира низата така што секој елемент
ќе се зголеми за разликата помеѓу најголемиот и најмалиот елемент.

На крај да се испечатат:
- најголемиот елемент
- најмалиот елемент
- сумата на елементите
- трансформираната низа

Пример:
Влез:
5
2 4 5 1 3

Излез:
MAX -> 5
MIN -> 1
SUM -> 15
6 8 9 5 7
*/