/*
За потребите на професорите и асистентите на ФИНКИ, потребна е програма за скалирање на поените на студентите за даден испит.
Од стандарден влез се читаат поените на најмногу 100 студенти и се сместуваат во низа.

Да се дефинира функција:
void scale(int scores[], int n)
која прима низа од броеви (поените на студентите на испитот) и го извршува скалирањето на следниот начин:

- Да се пронајде максималниот број на поени на испитот
  (на пример 88 од можни 100).
- Да се пресмета односот 100 / max
  (на пример 100 / 88 = 1.13636).
- Сите поени во низата да се помножат со овој однос,
  така што студентот со најмногу поени ќе добие 100 поени.
- Да се испечати низата со скалирани поени.

Трансформацијата треба да се направи на самата низа
(in-place), без користење на помошна низа.

Пример:
Влез:
5
10 20 30 40 82

Излез:
12.20 24.39 36.59 48.78 100.00
*/