// Задача 4
// Да се напише програма за пресметување на аритметичката средина на броевите 3, 5 и 12.
#include <iostream>
using namespace std;

int main() {
    int a=3, b=5, c=12;
    float as = (a+b+c)/3.0;
    cout<<as<<endl;
}
