// Задача 5
// Да се напише програма која ќе ги отпечати на екран остатоците при делењето на бројот 19 со 2, 3, 5 и 8.
#include <iostream>
using namespace std;

int main() {
    int a=19;
    cout<<a<<" % "<<2<<" = "<<a%2<<endl;
    cout<<a<<" % "<<3<<" = "<<a%3<<endl;
    cout<<a<<" % "<<5<<" = "<<a%5<<endl;
    cout<<a<<" % "<<8<<" = "<<a%8<<endl;

}
