// Задача 7
// Да се напише програма која од СВ ќе прочита два цели броеви и ќе ја испечати на компјутерскиот екран нивната сума,
// разлика, производ и остатокот при делењето.
#include <iostream>
using namespace std;

int main() {
    int a, b;
    cin >> a >> b;
    cout <<a<<" + "<<b<<" = " <<a + b<< endl;
    cout <<a<<" - "<<b<<" = " <<a - b<< endl;
    cout <<a<<" * "<<b<<" = " <<a * b<< endl;
    cout <<a<<" / "<<b<<" = " <<a / b<< endl;
    cout <<a<<" % "<<b<<" = " <<a % b<< endl;

}
