// Задача 8
// Да се напише програма која чита голема буква од стандарден влез и ја печати истата како мала буква.
// Напомена: Секој знак се претставува со ASCII број.
#include <iostream>
using namespace std;

int main() {
    char c;
    cin >> c;
    cout << char(c+('a'-'A'));

}
