// Задача 9
// Да се напише програма каде од тастатура ќе се внесе цена на производ, а потоа ќе ја испечати неговата цена со пресметан ддв.
//
// ПОМОШ: ДДВ е 18% од почетната цена
#include <iostream>
using namespace std;

int main() {
    double cena;
    cin >> cena;

    cout << cena * 1.18 << endl;
  
}
