/*
Напиши програма која ќе испечати колку зборови се палиндроми во дадена реченица (линија).
Првен се вчитува бројот N, потоа се вчитуваат линии.
Напомена: искористи cin.ignore() после вчитување на N доколку користите cin.getline().
Зборови од 1 буква се сметаат како палиндром, и проверката за палиндром да биде case-insensitive (Racecar е палиндром исто како и racecar) Не е дозволено користење на тип од string.

Input:
2
Was it a car or a cat I saw
Hello world

Result:
Was it a car or a cat I saw: 3
Hello world: 0

 */