/*
Од стандарден влез се чита број n и n елементи на една низа.
Да се транформира низата така што елементите со најголема вредност ќе ја добијат најмалата вредност од низата и обратно,
елементите со најмала вредност ќе ја добијат најголемата вредност од низата.
Трансформираната низа да се испечати на екран. 

Пример.

Влез:
5
1 2 5 4 5

Излез:
5 2 1 4 1
*/
#include <iostream>
using namespace std;
int main() {
    int n;
    cin >> n;
    int a[100];
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }

    int min = a[0],max = a[0];
    for (int i = 0; i < n; i++) {
        if (a[i] < min) {min = a[i];}
        if (a[i] > max) {max = a[i];}
    }
    for (int i = 0; i < n; i++) {
        if (a[i]==max) {
            a[i]=min;
        }else if (a[i]==min) {
            a[i]=max;
        }
    }
    for (int i = 0; i < n; i++) {
        cout << a[i] << " ";
    }
}
