/*
Од стандарден влез се вчитува број N и низа од N цели броеви.
За секој елемент од низата, да се испечати на стандарден излез колку други елементи од низата се поголеми или еднакви од самиот тој елемент.

Пример
Влез:
5
1 2 3 4 4

Излез:
[0] 1:4 (елементите 2,3,4,4 се поголеми или еднакви од елементот 1)
[1] 2:3 (елементите 3,4,4 се поголеми или еднакви од елементот 2)
[2] 3:2 (елементите 4,4, се поголеми или еднакви од елементот 3)
[3] 4:1 (само елементот 4 е поголем или еднаков од елементот 4 - во пресметката не се смета елементот самиот по себе)
[4] 4:1 (само елементот 4 е поголем или еднаков од елементот 4 - во пресметката не се смета елементот самиот по себе)
 */
#include <iostream>
using namespace std;
int main() {
    int n;
    cin >> n;
    int a[100];
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }
    for (int i = 0; i < n; i++) {
        int pogolemi=0;
        for (int j = 0; j < n; j++) {
            if (i != j && a[i] <= a[j]) {
                pogolemi++;
            }
        }
        cout<<"["<<i<<"]"<<" "<<a[i]<<":"<<pogolemi<<endl;
    }

}
