/*
На ФИНКИ е време за упис на нови студенти. За студент да се упиши, треба да пристигне на факултетот
пред 9 часот и да чека ред за да биде услужен од студентска служба. Студентска служба почнува со работа од 9 часот,
работи 2 часа, прави пауза 30 минути, работи 1 час, прави пауза 30 минути, работи 2 часа и нејзиното работно време завршува.

На студентска служба и е потребно точно 5 минути да услужи 1 студент.

Ваша задача е, ако знаете кој по ред е одреден студент во редицата за чекање,
да го испечатете времето во часови и минути кое тој го чека за да биде услужен
или да испечати на стандарден излез доколку студентот не е услужен.

Input: 25
Result: Hours: 2, minutes: 35
Input: 12
Result: Hours: 0, minutes: 55
*/
#include <iostream>
using namespace std;
int main() {
    int mesto,Vkupno, saat=0, minuti=0;
    cin >> mesto;
    if (mesto > 1 && mesto <= 60) {
        Vkupno =(mesto-1)*5;

        if (Vkupno>120) {
            Vkupno +=30;
        }
        if (Vkupno>210) {
            Vkupno +=30;
        }
        saat=Vkupno/60;
        minuti=Vkupno%60;

        cout<<"Hours: "<<saat<<","<< " minutes: "<<minuti<<endl;
    }else {
        cout<<"Studentot nema da e usluzen"<<endl;
    }


}
